src/ut10_old/DataProcessors/ЛК_ПечатьЦенниковБыстрая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЛК_ПечатьЦенниковБыстрая</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мах2недели</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/ut10_old/AccumulationRegisters/ТоварыВРознице.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРознице</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПродажная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/ut10_old/InformationRegisters/ЦеныАТТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЦеныАТТ</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ut10_old/DataProcessors/ЛК_ПечатьЦенниковБыстрая/Ext/ObjectModule.bsl
Перем СписокПапокГ;

Процедура НапечататьЦенникиПоСкладам(Склады)  Экспорт
	
	Для Каждого Скл Из Склады Цикл
		ВыводТДпоСкладу(Скл.Значение);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ВыводТДпоСкладу (СкладП)
	
	СводныйДокумент = Новый ТабличныйДокумент;
	
	СписокГруппировок = Справочники.ПечатьВЦенниках.Выбрать();
	
	Пока СписокГруппировок.Следующий() Цикл
		ГруппировкаП = СписокГруппировок.Ссылка; 
		СписокНоменклатуры = СписокНоменклатурыПоГруппе(ГруппировкаП, СкладП);
		ТекПеч = ГруппаНаПечать(ГруппировкаП, СписокНоменклатуры, СкладП);
		
		СводныйДокумент.Вывести(ТекПеч);
		////СводныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;	
	
	СводныйДокумент.АвтоМасштаб = Истина;
	СводныйДокумент.Показать();
	
		                  
КонецПроцедуры	

Функция СписокНоменклатурыПоГруппе(ГруппировкаП, СкладП)
	
	СписокПапок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ИСТИНА
		|	И Номенклатура.ПечатьВЦенниках = &ПечатьВЦенниках";
	
	Запрос.УстановитьПараметр("ПечатьВЦенниках", ГруппировкаП);
	
	СписокПапокГ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	СписокПапок = СписокПапокГ;	
	СписокВложенныхПапок = Папки(СписокПапок);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВРозницеОстатки.Номенклатура
		|ПОМЕСТИТЬ Ном
		|ИЗ
		|	РегистрНакопления.ТоварыВРознице.Остатки(, Склад = &СкладП) КАК ТоварыВРозницеОстатки
		|ГДЕ
		|	ТоварыВРозницеОстатки.КоличествоОстаток > 0
		|	И ТоварыВРозницеОстатки.Номенклатура В ИЕРАРХИИ(&СписокРодителей)
		|	И ТоварыВРозницеОстатки.Номенклатура.ЭтоГруппа = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
		Если Мах2недели = Истина Тогда
			Запрос.Текст = Запрос.Текст + "
										  |ВЫБРАТЬ
			                              |	ПеремещениеТоваровТовары.Номенклатура,
			                              |	МАКСИМУМ(ПеремещениеТоваровТовары.Цена) КАК Цена
			                              |ПОМЕСТИТЬ ВТ
			                              |ИЗ
			                              |	Ном КАК Ном
			                              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
			                              |		ПО Ном.Номенклатура = ПеремещениеТоваровТовары.Номенклатура
			                              |ГДЕ
			                              |	ПеремещениеТоваровТовары.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
			                              |	И ПеремещениеТоваровТовары.Ссылка.СкладПолучатель = &СкладПолучатель
			                              |
			                              |СГРУППИРОВАТЬ ПО
			                              |	ПеремещениеТоваровТовары.Номенклатура
			                              |
			                              |ОБЪЕДИНИТЬ ВСЕ
			                              |
			                              |ВЫБРАТЬ
			                              |	ЦеныАТТСрезПоследних.Номенклатура,
			                              |	МАКСИМУМ(ЦеныАТТСрезПоследних.Цена)
			                              |ИЗ
			                              |	Ном КАК Ном
			                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныАТТ.СрезПоследних(&Дата1, Склад = &СкладП) КАК ЦеныАТТСрезПоследних
			                              |		ПО Ном.Номенклатура = ЦеныАТТСрезПоследних.Номенклатура
			                              |
			                              |СГРУППИРОВАТЬ ПО
			                              |	ЦеныАТТСрезПоследних.Номенклатура
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ
			                              |	ВТ.Номенклатура,
			                              |	МАКСИМУМ(ВТ.Цена) КАК Цена
			                              |ИЗ
			                              |	ВТ КАК ВТ
										  |ГДЕ
			                              |	НЕ ВТ.Номенклатура ЕСТЬ NULL
			                              |
			                              |СГРУППИРОВАТЬ ПО
			                              |	ВТ.Номенклатура";
			
			Запрос.УстановитьПараметр("Дата1",НаДату - 2*7*24*60*60);
			Запрос.УстановитьПараметр("Дата2", НаДату + 60*60*24 - 1 );
			Запрос.УстановитьПараметр("СкладПолучатель", СкладП);
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|ВЫБРАТЬ
			|	ПеремещениеТоваровТовары.Цена КАК Цена,
			|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура
			|ИЗ
			|	Ном КАК Ном
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
			|		ПО Ном.Номенклатура = ПеремещениеТоваровТовары.Номенклатура
			|ГДЕ
			|	ПеремещениеТоваровТовары.Ссылка.Дата <= &Дата2
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПеремещениеТоваровТовары.Ссылка.Дата УБЫВ
			|ИТОГИ ПО
			|	Номенклатура";
			
			Запрос.УстановитьПараметр("Дата2", НаДату + 60*60*24 - 1 );
		КонецЕсли;

		Запрос.УстановитьПараметр("СкладП", СкладП);
		Запрос.УстановитьПараметр("СписокРодителей", СписокПапокГ);
			
	Если Мах2недели = Истина Тогда
			
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			 
	Иначе
		РезультатЗапроса = Новый ТаблицаЗначений;
		РезультатЗапроса.Колонки.Добавить("Номенклатура");
		РезультатЗапроса.Колонки.Добавить("Цена");
		
		Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
		
		Пока Результат.Следующий() Цикл
			ЦенаР = Результат.Выбрать();
			Если ЦенаР.Следующий() Тогда 
				Цена = ЦенаР.Цена;
			Иначе
				Цена = 0;
			КонецЕсли;
		Стр = РезультатЗапроса.Добавить();
		Стр.Номенклатура = Результат.Номенклатура;
		Стр.Цена = Цена;
		КонецЦикла;	 
		
	КонецЕсли;
	
	РезультатЗапроса.Сортировать("Номенклатура ВОЗР");
	
	Возврат  РезультатЗапроса;
						
КонецФункции
 
Функция Папки(СписокПапок)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ИСТИНА
		|	И Номенклатура.Родитель В(&Родитель)";
	
	Запрос.УстановитьПараметр("Родитель", СписокПапок);
	
	СписокПапок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если СписокПапок.Количество() > 0 Тогда
		Для Каждого Эл Из СписокПапок Цикл
			СписокПапокГ.Добавить(Эл);
		КонецЦикла;
		Папки(СписокПапок);
	КонецЕсли;	
	
КонецФункции	

Функция ГруппаНаПечать(ГруппировкаП, СписокНоменклатуры, СкладП)
	
	КолВоСтрокВсего = СписокНоменклатуры.Количество();
	Ц = КолВоСтрокВсего / (Константы.ПечатьКолВоСтрок.Получить()*2) ;
	ПроходыВсего = ?(Цел(Ц)-Ц = 0 , Цел(Ц), Цел(Ц) + 1) ; 
	
	ТД = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	
	ОбЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбЗаголовок.Параметры.тМагазин = СкладП.Наименование;
	ОбЗаголовок.Параметры.ВыбранныйСкладЮрЛицо = СкладП.ЮрЛицо.Наименование;
	ОбЗаголовок.Параметры.Дата = Строка(Формат(НаДату,"ДЛФ=DD"));
		
	ОбШапкаКол1 = Макет.ПолучитьОбласть("Шапка");
//	ОбШапкаКол2 = Макет.ПолучитьОбласть("Шапка|Колонка2");
	ОбСтрокаКол1 = Макет.ПолучитьОбласть("Строка|Колонка1");	
	ОбСтрокаКол2 = Макет.ПолучитьОбласть("Строка|Колонка2");
	
	Нстроки = 1;
	ТекПроход = 1;
	Пока ПроходыВсего > 0 Цикл
		ОбЗаголовок.Параметры.Страница = ТекПроход; 
		ТД.Вывести(ОбЗаголовок); 
		ОбШапкаКол1.Параметры.ГруппаНоменклатура = ВРег(ГруппировкаП.Наименование);
		ОбШапкаКол1.Параметры.ГруппаНоменклатура2 = ВРег(ГруппировкаП.Наименование);
		ТД.Вывести(ОбШапкаКол1); 
		СчТ = 1;
		ТДН = Новый ТабличныйДокумент;
		ТДН2 = Новый ТабличныйДокумент;
		Пока Нстроки <= Константы.ПечатьКолВоСтрок.Получить() * 2 * ТекПроход Цикл
			Если СчТ <= Константы.ПечатьКолВоСтрок.Получить() Тогда
			
				Попытка
					ОбСтрокаКол1.Параметры.НомерПП = Нстроки;
					ОбСтрокаКол1.Параметры.Номенклатура = СписокНоменклатуры[Нстроки-1].Номенклатура;
					ОбСтрокаКол1.Параметры.Цена = Строка(Формат(СписокНоменклатуры[Нстроки-1].Цена, "ЧДЦ=2")) + " руб.";
					ОбСтрокаКол1.Параметры.ЕдИзм = СписокНоменклатуры[Нстроки-1].Номенклатура.БазоваяЕдиницаИзмерения.Наименование;
				Исключение
					ОбСтрокаКол1.Параметры.НомерПП = "";
				    ОбСтрокаКол1.Параметры.Номенклатура = "";
					ОбСтрокаКол1.Параметры.Цена = "";
					ОбСтрокаКол1.Параметры.ЕдИзм = "";
				КонецПопытки;	
				ТДН.Вывести(ОбСтрокаКол1);
			//ИначеЕсли СчТ = Константы.ПечатьКолВоСтрок.Получить() + 1 Тогда
			//	ТД.Вывести(ТДН);
			Иначе
				
				Попытка
					ОбСтрокаКол2.Параметры.НомерПП = Нстроки;
					ОбСтрокаКол2.Параметры.Номенклатура = СписокНоменклатуры[Нстроки-1].Номенклатура;
					ОбСтрокаКол2.Параметры.Цена = Строка(Формат(СписокНоменклатуры[Нстроки-1].Цена, "ЧДЦ=2")) + " руб.";
					ОбСтрокаКол2.Параметры.ЕдИзм = СписокНоменклатуры[Нстроки-1].Номенклатура.БазоваяЕдиницаИзмерения.Наименование;
				Исключение
					ОбСтрокаКол2.Параметры.НомерПП = "";
				    ОбСтрокаКол2.Параметры.Номенклатура = "";
					ОбСтрокаКол2.Параметры.Цена = "";
					ОбСтрокаКол2.Параметры.ЕдИзм = "";
				КонецПопытки;
					ТДН2.Вывести(ОбСтрокаКол2);
			КонецЕсли;	
			Нстроки = Нстроки + 1 ;	
			СчТ = СчТ + 1 ;
		КонецЦикла;
		//ТДН2.Показать();
		ТДН.ВставитьОбласть(ТДН2.Область("R1C1:R"+Строка(Константы.ПечатьКолВоСтрок.Получить())+"C5"), ТДН.Область("R1C7")); 
		//ОБЛ = ТДН.ПолучитьОбласть(;
		//ОБЛ.Присоединить(ТДН2);
		//ТДН.Показать();
		ТД.Вывести(ТДН);
		ПроходыВсего = ПроходыВсего - 1 ;
		ТекПроход = ТекПроход + 1;
		ТД.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;	
		
	Возврат ТД;
		
КонецФункции

Функция ПолучитьЛисток (КолСтрок)
	
		
	
КонецФункции
